In [1]:
import pandas as pd
import numpy as np

In [ ]:
#DataFrame.transform(func, axis=0, *args, **kwargs)

In [3]:
df = pd.DataFrame(
    {'A': range(3), 
     'B': range(1, 4)
    }
)
df

   A  B
0  0  1
1  1  2
2  2  3

In [4]:
df.transform(lambda x: x + 1)

   A  B
0  1  2
1  2  3
2  3  4

In [5]:
s = pd.Series(range(3))
s

0    0
1    1
2    2
dtype: int64

In [15]:
df = pd.DataFrame({
    "Date": ["2015-05-08", "2015-05-07", "2015-05-06", "2015-05-05","2015-05-08", "2015-05-07", "2015-05-06", "2015-05-05"],
    "Data": [5, 8, 6, 1, 50, 100, 60, 120],
})
df

         Date  Data
0  2015-05-08     5
1  2015-05-07     8
2  2015-05-06     6
3  2015-05-05     1
4  2015-05-08    50
5  2015-05-07   100
6  2015-05-06    60
7  2015-05-05   120

In [19]:
df.groupby('Date')['Data'].transform('sum')

#df.groupby('Date')['Data'].apply(np.sum)

0     55
1    108
2     66
3    121
4     55
5    108
6     66
7    121
Name: Data, dtype: int64

In [12]:
df = pd.DataFrame({
    "c": [1, 1, 1, 2, 2, 2, 2],
    "type": ["m", "n", "o", "m", "m", "n", "n"]
})
df

   c type
0  1    m
1  1    n
2  1    o
3  2    m
4  2    m
5  2    n
6  2    n

In [13]:
df['size'] = df.groupby('c')['type'].transform(len)
df

   c type  size
0  1    m     3
1  1    n     3
2  1    o     3
3  2    m     4
4  2    m     4
5  2    n     4
6  2    n     4